Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_gateway_response.default_4xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_4xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_gateway_response.default_5xx_cors will be updated in-place
~ resource "aws_api_gateway_gateway_response" "default_5xx_cors" {
        id                  = "aggr-70paytfqfb-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "kzynys" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy.recap_ddb_access will be created
+ resource "aws_iam_role_policy" "recap_ddb_access" {
      + id          = (known after apply)
      + name        = "RecapDdbAccess"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-2:825765422855:table/weekly_news_posts",
                          + "arn:aws:dynamodb:us-east-2:825765422855:table/weekly_news_posts/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sharedservices_lambda_role"
    }

  # aws_iam_role_policy.recap_ddb_scan will be created
+ resource "aws_iam_role_policy" "recap_ddb_scan" {
      + id          = (known after apply)
      + name        = "RecapDdbScan"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-2:825765422855:table/weekly_news_posts"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sharedservices_lambda_role"
    }

  # aws_iam_role_policy.recap_invoke_notify will be created
+ resource "aws_iam_role_policy" "recap_invoke_notify" {
      + id          = (known after apply)
      + name        = "RecapInvokeNotifyPost"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:us-east-2:825765422855:function:notify_post"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sharedservices_lambda_role"
    }

  # aws_lambda_function.notify_post will be updated in-place
~ resource "aws_lambda_function" "notify_post" {
        id                             = "notify_post"
      ~ last_modified                  = "2025-05-02T07:26:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "8F5H4kALcMyPv4Wyix3IYxhDnSnvwpo65Z3cW8Z1o+c=" -> "DyWYHaFJto7gY3IRHsDdaQOskiLhOJmtfcOYSEljdSE="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.weekly_news_recap will be updated in-place
~ resource "aws_lambda_function" "weekly_news_recap" {
        id                             = "sharedservices-weekly-news-recap"
      ~ last_modified                  = "2025-07-12T02:10:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "3wIXrOCfsl9HopXvN27aF/HNSHUCv1e4XB9viTmvIic=" -> "kYh3vDEYl/X2zj8W92yBSMPM4bLsNl2CRv1LIP0H5+A="
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 5 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 3 to add, 5 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```